-- phpMyAdmin SQL Dump
-- version 3.4.9
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2012 年 03 月 13 日 04:26
-- 服务器版本: 5.0.84
-- PHP 版本: 5.2.16

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `tp_xieche`
--

-- --------------------------------------------------------

--
-- 表的结构 `xc_car_brand`
--

CREATE TABLE IF NOT EXISTS `xc_car_brand` (
  `brand_id` int(10) unsigned NOT NULL auto_increment COMMENT '品牌ID',
  `word` char(2) NOT NULL COMMENT '首字母',
  `brand_name` char(25) NOT NULL COMMENT '品牌名称',
  PRIMARY KEY  (`pinpai_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=158 ;

--
-- 转存表中的数据 `xc_car_brand`
--

INSERT INTO `xc_car_brand` (`brand_id`, `word`, `brand_name`) VALUES
(34, 'A', '阿尔法罗密欧'),
(35, 'A', '阿斯顿·马丁'),
(33, 'A', '奥迪'),
(140, 'B', 'BRABUS巴博斯'),
(120, 'B', '宝骏'),
(15, 'B', '宝马'),
(40, 'B', '保时捷'),
(154, 'B', '北汽制造'),
(36, 'B', '奔驰'),
(95, 'B', '奔腾'),
(14, 'B', '本田'),
(75, 'B', '比亚迪'),
(13, 'B', '标致'),
(38, 'B', '别克'),
(39, 'B', '宾利'),
(37, 'B', '布加迪'),
(79, 'C', '昌河'),
(76, 'C', '长安'),
(77, 'C', '长城'),
(78, 'C', '长丰'),
(111, 'C', '川汽野马'),
(157, 'D', 'Dacia'),
(92, 'D', '大发'),
(1, 'D', '大众'),
(41, 'D', '道奇'),
(105, 'D', '帝豪'),
(32, 'D', '东风'),
(113, 'D', '东风风神'),
(142, 'D', '东风小康'),
(81, 'D', '东南'),
(42, 'F', '法拉利'),
(11, 'F', '菲亚特'),
(3, 'F', '丰田'),
(141, 'F', '福迪'),
(8, 'F', '福特'),
(96, 'F', '福田'),
(112, 'G', 'GMC'),
(116, 'G', '光冈'),
(82, 'G', '广汽'),
(24, 'H', '哈飞'),
(150, 'H', '海格'),
(86, 'H', '海马'),
(43, 'H', '悍马'),
(91, 'H', '红旗'),
(85, 'H', '华普'),
(87, 'H', '华泰'),
(97, 'H', '黄海'),
(46, 'J', 'Jeep吉普'),
(108, 'J', '吉奥'),
(25, 'J', '吉利'),
(104, 'J', '吉利全球鹰'),
(84, 'J', '江淮'),
(119, 'J', '江铃'),
(44, 'J', '捷豹'),
(83, 'J', '金杯'),
(151, 'J', '九龙'),
(156, 'K', '卡尔森'),
(101, 'K', '开瑞'),
(47, 'K', '凯迪拉克'),
(100, 'K', '柯尼赛格'),
(9, 'K', '克莱斯勒'),
(48, 'L', '兰博基尼'),
(121, 'L', '蓝旗亚'),
(118, 'L', '劳伦士'),
(54, 'L', '劳斯莱斯'),
(52, 'L', '雷克萨斯'),
(10, 'L', '雷诺'),
(124, 'L', '理念'),
(80, 'L', '力帆'),
(89, 'L', '莲花汽车'),
(51, 'L', '林肯'),
(53, 'L', '铃木'),
(88, 'L', '陆风'),
(49, 'L', '路虎'),
(50, 'L', '路特斯'),
(155, 'M', 'MAXUS大通'),
(20, 'M', 'MG'),
(56, 'M', 'MINI'),
(58, 'M', '马自达'),
(57, 'M', '玛莎拉蒂'),
(55, 'M', '迈巴赫'),
(136, 'N', 'Noble'),
(130, 'N', '纳智捷'),
(60, 'O', '讴歌'),
(59, 'O', '欧宝'),
(61, 'P', '帕加尼'),
(26, 'Q', '奇瑞'),
(62, 'Q', '起亚'),
(63, 'R', '日产'),
(19, 'R', '荣威'),
(103, 'R', '瑞麒'),
(137, 'S', 'Scion'),
(45, 'S', 'smart'),
(64, 'S', '萨博'),
(68, 'S', '三菱'),
(149, 'S', '陕汽通家'),
(66, 'S', '世爵'),
(90, 'S', '双环'),
(69, 'S', '双龙'),
(65, 'S', '斯巴鲁'),
(67, 'S', '斯柯达'),
(135, 'T', 'TVR'),
(102, 'W', '威麟'),
(143, 'W', '威旺'),
(99, 'W', '威兹曼'),
(70, 'W', '沃尔沃'),
(114, 'W', '五菱汽车'),
(7, 'X', '夏利'),
(12, 'X', '现代'),
(71, 'X', '雪佛兰'),
(72, 'X', '雪铁龙'),
(110, 'Y', '一汽'),
(144, 'Y', '依维柯'),
(73, 'Y', '英菲尼迪'),
(106, 'Y', '英伦'),
(93, 'Y', '永源'),
(22, 'Z', '中华'),
(74, 'Z', '中兴'),
(94, 'Z', '众泰');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
